<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
	<title>Congreso Nacional de Software Libre</title>
	<meta http-equiv="Content-Language" content="English" />
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
	<meta name="author" content="David Herreman (www.free-css-templates.com)" />
	<meta name="description" content="Free Css Template" />
	<meta name="keywords" content="cnsl" />	
	<meta name="Robots" content="index,follow" />
	<meta name="Generator" content="sNews 1.5" />
	<link rel="stylesheet" type="text/css" href="style.css" media="screen" />
<link rel="shortcut icon" type="image/ico" href=favicon.ico"/>
<link rel="shortcut icon" href="favicon.ico">
</head>
<body>
	
<div class="content">
	<div id="top">
				<div id="icons">
					<a href="index.html" title="Home page"><img src="images/home.gif" alt="Home" /></a>
				</div>
				<h1>S&eacute;ptimo Congreso Nacional de Software Libre</h1>
				<h2>del 29 de Abril al 30 de Julio, 2011, Venezuela</h2>
	</div>
	<!-- end of the Top part -->
</div>			

<div id="prec">
	<div id="wrap">
			<div id="pic">
				<div id="slogan">
					<h1>¿Qué es el CNSL?</h1>
					<h2>El S&eacute;ptimo Congreso Nacional de Software Libre (Venezuela 2011) es una serie 
					ordenada de eventos que se iniciarán en abril y culminarán en julio de 2011 y visitará 11 
					ciudades de Venezuela en esta oportunidad. Entre uno de sus principales objetivos se 
					encuentra el de concentrar a una selección importante de expertos nacionales e internacionales 
					en el uso de GNU/Linux y el Software Libre en un ciclo de ponencias y demostraciones, ofreciendo 
					a todos los participante una muestra integral del Software Libre y el Sistema Operativo GNU/Linux, 
					su implementación, características, posibilidades y valores éticos. <br />
					</h2>
				</div>
			</div>
			<div id="menu">
						<ul>	
							<li><a href="index.html" title="Inicio">Inicio</a></li>
							<li><a href="ponencias.html" title="Ponencias">Ponencias Regionales</a></li>
							<li><a href="documentos.html" title="Documentacion">Documentos</a></li>
							<li><a href="galeria.html" title="Galeria">Multimedia</a></li>
							<li><a href="historia.html" title="Historia">Historia del CNSL</a></li>	
							<li><a href="proyectos.html" title="Proyectos">Proyectos</a></li>
							<li><a href="patrocinio.html" title="Patrocinadores">Patrocinadores</a></li>
							<li><a href="http://www.cnsl.org.ve" title="http://www.cnsl.org.ve">Página Web Oficial del Evento</a></li>				
							<li><a href="creditos.html" title="Creditos">Créditos</a></li>	
						</ul>
			</div>
	</div>
</div>

<div class="content">

NOTA: algunos vínculos llevan a sitios en Internet. Si quiere verlos deberá tener una conexión activa en ese momento.

<h2>El Software Libre es Libre, punto y final.</h2>

<p>
Si buscamos la definici&oacute;n de SOFTWARE LIBRE nos encontraremos con algo que deja poco a la interpretaci&oacute;n del 
t&eacute;rmino. De hecho quien lo escribi&oacute; (Richard Stallman) se preocupa sistem&aacute;tica y cuidadosamente en 
colocar las palabras en el lugar adecuado y se ha dado a la tarea de estar detalladamente atento de que en todos los 
idiomas en los cuales se han traducido los textos que gu&iacute;an el movimiento del SOFTWARE LIBRE exista igual cuido 
de los t&eacute;rminos que se usan en el lenguaje escrito precisamente para no dar espacio a distintas interpretaciones 
ni mucho menos a errores en la comunicaci&oacute;n verbal.
</p>

<p>
Esto lo digo porque si buscamos en alg&uacute;n diccionario qu&eacute; es, por ejemplo “Ox&iacute;geno” encontraremos 
algo que no tiene posibilidad de interpretarlo m&aacute;s all&aacute; de lo que es: el elemento n&uacute;mero ocho de 
la tabla peri&oacute;dica. Punto y final. No hay que ponerse a pelear con quien hizo la tabla peri&oacute;dica por eso 
ni cuestionar las leyes de la qu&iacute;mica y la f&iacute;sica para cambiarle el nombre o desacreditar quien se lo puso 
porque le cae mal o no le gustaba el tono de voz del cient&iacute;fico que le puso el nombre. El ox&iacute;geno es ox&iacute;geno y punto ¿no?.
</p>

<p>
Bueno, sucede algo desconcertante con el t&eacute;rmino SOFTWARE LIBRE: hay gente que cuestiona que si un desarrollo no 
cumple con la definici&oacute;n del t&eacute;rmino debe o no ser llamado Software Libre. Nunca falta alguien que diga que 
un desarrollo que no cumple (ni respeta) las libertades cero, uno, dos y tres del SOFTWARE LIBRE, es SOFTWARE LIBRE y casi 
siempre su discurso viene acompa&ntilde;ado con argumentos donde aqu&eacute;l que no est&eacute; de acuerdo con su posici&oacute;n 
es un fundamentalista y fan&aacute;tico. Se molestan con Richard Stallman y con cualquier persona que diga pertenecer o 
simpatizar con sus conceptos (SOFTWARE LIBRE), sus instituciones (FSF y sus extensiones), su filosof&iacute;a (GNU) y sus 
metas (La liberaci&oacute;n del ciberespacio) porque existe un concepto muy bien definido de lo que es SOFTWARE LIBRE.
</p>

<p>
A ver si con un ejemplo metafórico se entiende:<br />
Somos agricultores y vamos a sembrar frutas. Preparamos la tierra, planificamos el sistema de riego y escogemos las 
semillas que se van a plantar. En ese punto viene alguien a decir que somos unos extremistas, porque no aceptamos que 
se incluyeran en la selecci&oacute;n a unas semillas que &eacute;l trajo, que hacen crecer unas hiedras venenosas de 
hojas muy verdes y brillantes. Dice entonces que esta organizaci&oacute;n de agricultores es extremista y que no entienden 
que la agricultura no debe ser restringida y que deben haber tambi&eacute;n venta de hojas de hiedras venenosas junto a 
las verduras y hortalizas del mercado, puesto que las hiedras venenosas son muy efectivas para tal o cual cosa.
</p>

<p>
Otro ejemplo metafórico para ver si me logro explicar mejor:<br />
Si nuestra profesi&oacute;n es la medicina y nuestra misi&oacute;n es ser quienes cuiden la salud de las personas no 
podemos aceptar que se promueva el vicio del cigarrillo nisiquiera si la empresa tabacalera nos va a ayudar a que las 
salas de terapia intensiva para pacientes con deficiencia respiratoria cr&iacute;tica tenga mejores equipos. Si a la 
gente les gusta fumar y botar el humo por la nariz, est&aacute;n en su derecho de matarse, pero NO pueden pretender decir 
que su libertad de matarse lentamente debe ser promovida, auspiciada y defendida por los m&eacute;dicos. Hay m&eacute;dicos 
que defienden el cigarrilo, supongo, pero definitivamente ni son la inmensa mayor&iacute;a ni tienen argumentos que aguanten 
un asalto.
</p>

<p>
Por eso SOFTWARE LIBRE es aqu&eacute;l que respeta las libertades esenciales del usuario y que no permite en su licencia 
que el usuario sufra de la imposici&oacute;n de esposas digitales. Aqu&eacute;l desarrollo de un programa inform&aacute;tico 
que no cumpla con eso NO ES SOFTWARE LIBRE. Punto.
</p>

<p>
Pueden ponerse bravos porque el ox&iacute;geno use como s&iacute;mbolo la letra O en la tabla peri&oacute;dica y que en la 
naturaleza se consiga frecuentemente en estado gaseoso y agrupado en mol&eacute;culas de dos &aacute;tomos. Puede molestarse 
much&iacute;simo con la ciencia de la qu&iacute;mica porque el ox&iacute;geno sea incoloro y rayar la madre de quienes le 
pusieron el nombre y pasaron a la historia por eso. Est&aacute;n en su derecho de molestarse todo lo que les de la gana por 
eso, pero si tratan de demostrar en su rabia e impotencia contra el mundo que una navaja “Swiss Army” es un elemento de la 
tabla peri&oacute;dica y que merece el puesto n&uacute;mero ocho y la letra O may&uacute;scula como su s&iacute;mbolo se 
conseguir&aacute;n con la comunidad de qu&iacute;micos que tendr&aacute;n reacciones varias, desde ignorarlos hasta hacerles 
se&ntilde;as extra&ntilde;as con las manos o los brazos, dado el caso del tono con el cual se les quiera hacer entender el 
mensaje. As&iacute; la navaja tenga como dise&ntilde;o un grupo de letras O con un n&uacute;mero 2 peque&ntilde;o como sub&iacute;ndice 
no podr&aacute;n entrar en la tabla peri&oacute;dica ni sustituir al ox&iacute;geno que estar&aacute; all&iacute; en su 
mismo lugar por much&iacute;simo tiempo m&aacute;s, probablemente hasta el fin de la humanidad, si es que tendr&aacute; fin.
</p>

<p>
…y siempre en la humanidad estaremos los seres llamados a cuidar y preservar las libertades del usuario 
(que no es la libertad de usar Software Privativo, puesto que en ello no hay libertad alguna sino dependencia), 
llamando por su nombre a las cosas y llamando SOFTWARE LIBRE a lo que lo sea y no a lo que parezca o algunos traten 
de discutir si puede hacerse o no pasar por tal.

</p>
<br />
<samp>Fuente:</samp>&nbsp; <a href="http://octavio.gnu.org.ve/el-software-libre-es-libre-punto-y-final/" target="_blank" >La Bit&aacute;cora de [TR0N]</a>

<br/>

<div id="footer">
	<div class="right">Diseño: <a href="http://www.free-css-templates.com">David Herreman</a></div>
	&copy; Copyleft 2011, Proyecto GNU de Venezuela
	</div>
</div>

</body>
</html>
