<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
	<title>Congreso Nacional de Software Libre</title>
	<meta http-equiv="Content-Language" content="English" />
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
	<meta name="author" content="David Herreman (www.free-css-templates.com)" />
	<meta name="description" content="Free Css Template" />
	<meta name="keywords" content="cnsl" />	
	<meta name="Robots" content="index,follow" />
	<meta name="Generator" content="sNews 1.5" />
	<link rel="stylesheet" type="text/css" href="style.css" media="screen" />
<link rel="shortcut icon" type="image/ico" href=favicon.ico"/>
<link rel="shortcut icon" href="favicon.ico">
</head>
<body>
	
<div class="content">
	<div id="top">
				<div id="icons">
					<a href="index.html" title="Home page"><img src="images/home.gif" alt="Home" /></a>
				</div>
				<h1>S&eacute;ptimo Congreso Nacional de Software Libre</h1>
				<h2>del 29 de Abril al 30 de Julio, 2011, Venezuela</h2>
	</div>
	<!-- end of the Top part -->
</div>			

<div id="prec">
	<div id="wrap">
			<div id="pic">
				<div id="slogan">
					<h1>¿Qué es el CNSL?</h1>
					<h2>El S&eacute;ptimo Congreso Nacional de Software Libre (Venezuela 2011) es una serie 
					ordenada de eventos que se iniciarán en abril y culminarán en julio de 2011 y visitará 11 
					ciudades de Venezuela en esta oportunidad. Entre uno de sus principales objetivos se 
					encuentra el de concentrar a una selección importante de expertos nacionales e internacionales 
					en el uso de GNU/Linux y el Software Libre en un ciclo de ponencias y demostraciones, ofreciendo 
					a todos los participante una muestra integral del Software Libre y el Sistema Operativo GNU/Linux, 
					su implementación, características, posibilidades y valores éticos. <br />
					</h2>
				</div>
			</div>
			<div id="menu">
						<ul>	
							<li><a href="index.html" title="Inicio">Inicio</a></li>
							<li><a href="ponencias.html" title="Ponencias">Ponencias Regionales</a></li>
							<li><a href="documentos.html" title="Documentacion">Documentos</a></li>
							<li><a href="galeria.html" title="Galeria">Multimedia</a></li>
							<li><a href="historia.html" title="Historia">Historia del CNSL</a></li>	
							<li><a href="proyectos.html" title="Proyectos">Proyectos</a></li>
							<li><a href="patrocinio.html" title="Patrocinadores">Patrocinadores</a></li>
							<li><a href="http://www.cnsl.org.ve" title="http://www.cnsl.org.ve">Página Web Oficial del Evento</a></li>				
							<li><a href="creditos.html" title="Creditos">Créditos</a></li>	
						</ul>
			</div>
	</div>
</div>

<div class="content">

NOTA: algunos vínculos llevan a sitios en Internet. Si quiere verlos deberá tener una conexión activa en ese momento.

<h2>Porque debemos llamar GNU/Linux a todo el sistema en lugar de solo Linux</h2>

<p>
En 1984, luego de una serie de incidentes con el software privativo que no permitieron a Richard Stallman hacer su 
trabajo, y de que en el laboratorio de Inteligencia Artificial del MIT le exigiesen firmar un contrato de no divulgaci&oacute;n, 
este decide que no será capaz de vivir as&iacute;, y como nada de lo que ocurr&iacute;a era ilegal, decide ponerse a 
trabajar en la creaci&oacute;n desde cero de un nuevo sistema operativo que respetara las libertades que son tan 
importantes para poder hacer un uso real de una computadora. El sistema GNU.
</p>

<p>
No estaba en su mente crear un sistema rival, solo deseaba que todo aquel que tuviese las necesidades que &eacute;l tenia, 
no se viese perjudicado por los cambios que se estaban dando en relaci&oacute;n a como se publicaban los programas. 
Comenz&oacute; a trabajar en un sistema que fuese compatible con UNIX, no era su ideal de sistema operativo, pero para 
la fecha era el m&aacute;s usado, as&iacute; que comenz&oacute; a escribir desde cero todos y cada uno de los elementos 
que hac&iacute;an funcionar UNIX, con la ayuda de todos aquellos programadores que escucharon su llamado.
</p>

<p>
Para cuando Linus Torvalds decide que quiere un sistema UNIX funcionando en su 80386, y que lo escribir&aacute; el mismo 
ya que el costo de la licencia para UNIX estaba fuera de su alcance y su profesor Andrew Tanenbaum le neg&oacute; la 
posibilidad de modificar Minix para adaptarlo a su necesidades, el proyecto GNU ya hab&iacute;a escrito todo lo que hacia 
falta para que un sistema operativo completo funcionase, excepto un componente, el n&uacute;cleo.
</p>

<p>
Para aquellos que no tienen muy claro que es exactamente el n&uacute;cleo o kernel, es una capa de software que se 
encuentra entre todo lo que es el sistema operativo y el hardware, su funci&oacute;n es administrar los recursos de 
hardware imposibilitando que cualquier programa tenga acceso directo a este, y la raz&oacute;n por la que esta capa 
es necesaria, es que es posible que un programa mal escrito literalmente queme el microprocesador; por lo tanto el n&uacute;cleo 
evita que los errores del programador da&ntilde;en el sistema. Ya que se suele hacer analog&iacute;as entre los sistemas 
operativos y los autom&oacute;viles, como una manera de facilitar la comprensi&oacute;n de la importancia del software 
libre, el kernel ser&iacute;a como los neum&aacute;ticos de un auto, no es el elemento m&aacute;s impresionante del carro, 
pero este no ira a ninguna parte sin ellos.
</p>

<p>
Bien, la cosa es que cuando Linus Torvalds decide escribir su sistema operativo, encuentra en el proyecto GNU todo lo 
que hace falta, y &eacute;l solo rellena el vaci&oacute;, publica en 1991 un sistema llamado Frix, que no era software 
libre ya que su licencia conten&iacute;a una clausula que imped&iacute;a su uso con fines comerciales, es decir que no 
era posible utilizarlo con cualquier fin.
</p>

<p>
En 1992 se publica Linux bajo la licencia GPL de GNU y finalmente, desde que en 1984 Richard Stallman comenzara la jornada 
de escribir un sistema operativo completamente libre, La FSF (Fundacion del Software Libre) tiene a su disposici&oacute;n 
un sistema operativo completamente libre, no se le dio importancia en aquel entonces al nombre porque lo realmente 
importante es que finalmente se tenia la pieza que hacia falta para comenzar el trabajo, o sea, comenzar a promover la 
libertad del usuario en el uso de computadoras ofreciendo una alternativa libre.
</p>

<p>
Muchos comenzaron a usar Linux, y a hacer uso de las libertades que les daba la licencia para hacer variantes de este y a 
todas ellas se les llamo Linux, luego aparecieron las distribuciones y poco a poco m&aacute;s gente comenz&oacute; a usar 
el sistema, ya que las distribuciones facilitaban la tarea y cualquiera pod&iacute;a usarlo (claro, en aquel entonces, cualquiera 
que estuviese dispuesto a hacer lo que hiciera falta), por lo que el sistema comenz&oacute; a ganar notoriedad.
</p>

<p>
Mientras todo esto pasaba, Richard Stallman estaba trabajando en dar a conocer el concepto de software libre y la 
importancia de que los programas respeten las libertades del usuario.
</p>

<p>
La cosa es que cuando los medios de comunicaci&oacute;n comenzaron a indagar sobre el software libre, buscaban a 
Linus Torvalds creador de Linux para que les comentara sobre eso del software libre y esa libertad de la que 
hablaba Richard Stallman, y la respuesta de Torvalds fue: yo no pienso que el software deba mezclarse con la pol&iacute;tica.
</p>

<p>
La cosa es, que la manera de pensar de Linus Torvalds se ha convertido en un obst&aacute;culo para que la FSF haga su 
trabajo de defender las libertades de los usuarios, porque el se&ntilde;or Linus Torvalds no piensa que esto sea algo 
por lo que valga la pena luchar. No me mal entiendan, el tiene el derecho de pensar lo que quiera, y se le debe respetar.
</p>

<p>
Fue a ra&iacute;z de esta situaci&oacute;n que Richard Stallman comenz&oacute; a pedir que se llamara al sistema 
GNU con Linux, porque ve&iacute;a como el esfuerzo que llevaba m&aacute;s de diez a&ntilde;os se venia abajo, 
debido a la manera de pensar de Linus Torvalds, porque, ¿quien puede tomar en serio las palabras de un hombre cuando 
el creador del sistema dice no estar de acuerdo con &eacute;l?
</p>

<p>
El trabajo del proyecto GNU, fue mucho m&aacute;s extenso que el de Linus Torvalds, y lo &uacute;nico que pide 
Richard Stallman es que se le de al menos el mismo cr&eacute;dito al proyecto GNU, porque as&iacute; sus palabras 
ser&aacute;n tomadas en serio, y puede continuar con la tarea que comenz&oacute; 7 a&ntilde;os antes de que el 
capricho de un estudiante lo llevara a escribir Linux, quien si hubiese tenido la posibilidad de adquirir una licencia 
de UNIX jam&aacute;s lo hubiese hecho, o si hubiese sabido que para aquel entonces lo que &eacute;l estaba escribiendo 
ya se hab&iacute;a materializado en el proyecto BSD, como en muchas ocasiones &eacute;l mismo lo ha dicho.
</p>

<p>
Son incontables los foros en lo que esto se ha discutido, e igualmente incontable lo que se puede argumentar para llamarlo 
de una u otra forma, pero estos son los hechos, la &uacute;nica raz&oacute;n por la que se inicio en 1984 el trabajo de 
escribir el sistema GNU, es que hacia falta para poder ofrecer a los usuarios de computadoras una alternativa que 
respetara sus libertades. Linus Torvalds, publico en 1992 un sistema operativo llamado Linux (de la misma forma en que 
el que estas usando en este momento muy probablemente se llama Ubuntu), y salvo que se este usando ese sistema operativo, 
llamar gen&eacute;ricamente Linux a cualquier distribuci&oacute;n es incorrecto. Las opiniones de Linus Torvalds quien 
insiste en que no se debe mezclar la pol&iacute;tica y el software, raz&oacute;n por la cual prefiere hablar de c&oacute;digo 
abierto (open source) son un obst&aacute;culo para que los usuarios puedan comprender el concepto de software libre, por 
lo que llamar al sistema gen&eacute;ricamente GNU/Linux permite que los usuarios comprendan que el proyecto GNU tiene algo 
que decir al respecto.
</p>
<br/>

<samp>Fuente:</samp>&nbsp; <a href="http://oscar.gnu.org.ve/2011/porque-debemos-llamar-gnulinux-a-todo-el-sistema-en-lugar-de-solo-linux/" target="_blank">[comanche]</a><br />

<div id="footer">
	<div class="right">Diseño: <a href="http://www.free-css-templates.com">David Herreman</a></div>
	&copy; Copyleft 2011, Proyecto GNU de Venezuela
	</div>
</div>

</body>
</html>
