<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
	<title>Congreso Nacional de Software Libre</title>
	<meta http-equiv="Content-Language" content="English" />
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
	<meta name="author" content="David Herreman (www.free-css-templates.com)" />
	<meta name="description" content="Free Css Template" />
	<meta name="keywords" content="cnsl" />	
	<meta name="Robots" content="index,follow" />
	<meta name="Generator" content="sNews 1.5" />
	<link rel="stylesheet" type="text/css" href="style.css" media="screen" />
	<link rel="alternate" type="application/rss+xml" title="RSS 2.0" href="rss/" />
<link rel="shortcut icon" type="image/ico" href=favicon.ico"/>
<link rel="shortcut icon" href="favicon.ico" />
</head>
<body>
	
<div class="content">
	<div id="top">
				<div id="icons">
					<a href="index.html" title="Home page"><img src="images/home.gif" alt="Home" /></a>
				</div>
				<h1>S&eacute;ptimo Congreso Nacional de Software Libre</h1>
				<h2>del 29 de Abril al 30 de Julio, 2011, Venezuela</h2>
	</div>
	<!-- end of the Top part -->
</div>			

<div id="prec">
	<div id="wrap">
			<div id="pic">
				<div id="slogan">
					<h1>¿Qué es el CNSL?</h1>
					<h2>El S&eacute;ptimo Congreso Nacional de Software Libre (Venezuela 2011) es una serie 
					ordenada de eventos que se iniciarán en abril y culminarán en julio de 2011 y visitará 11 
					ciudades de Venezuela en esta oportunidad. Entre uno de sus principales objetivos se 
					encuentra el de concentrar a una selección importante de expertos nacionales e internacionales 
					en el uso de GNU/Linux y el Software Libre en un ciclo de ponencias y demostraciones, ofreciendo 
					a todos los participante una muestra integral del Software Libre y el Sistema Operativo GNU/Linux, 
					su implementación, características, posibilidades y valores éticos. <br />
					</h2>
				</div>
			</div>
			<div id="menu">
						<ul>	
							<li><a href="index.html" title="Inicio">Inicio</a></li>
							<li><a href="ponencias.html" title="Ponencias">Ponencias Regionales</a></li>
							<li><a href="documentos.html" title="Documentacion">Documentos</a></li>
							<li><a href="galeria.html" title="Galeria">Multimedia</a></li>
							<li><a href="historia.html" title="Historia">Historia del CNSL</a></li>	
							<li><a href="proyectos.html" title="Proyectos">Proyectos</a></li>
							<li><a href="patrocinio.html" title="Patrocinadores">Patrocinadores</a></li>
							<li><a href="http://www.cnsl.org.ve" title="http://www.cnsl.org.ve">Página Web Oficial del Evento</a></li>				
							<li><a href="creditos.html" title="Creditos">Créditos</a></li>	
						</ul>
			</div>
	</div>
</div>

<div class="content">

		<img src="images/Ponentes/Octavio.png" alt="img" id="ponencia" />
		<h3>
		Software Libre, GNU, Comunidad y Linux<br />
		Octavio Rossell (Proyecto GNU de Venezuela).<br /></h3>
		 Charla Inicial introductoria para toda persona que desee conocer las bases hist&oacute;ricas y filos&oacute;ficas 
		 del Software Libre y el Movimiento GNU. Se hace un paseo por el Sistema Operativo GNU/Linux del cual 
		 se esbozan algunos de sus detalles t&eacute;cnicos, pero manteniendo la charla para todo p&uacute;blico. 
		 Se abordan temas como las licencias libres, ventajas, desventajas y caracter&iacute;sticas de GNU/Linux, 
		 Canaima GNU/Linux y el marco legal venezolano en materia de Tecnolog&iacute;as Libres.<br />
		<a href="ponencias/Software Libre, GNU, Comunidad y Linux.pdf">&nbsp;Descargar Presentaci&oacute;n...</a>		
		<br /><br /><br />
	<hr />

		<img src="images/Ponentes/NaudyVillarroel.png" alt="img" id="ponencia" />
		<h3>
		 Como podemos Vencer el miedo de migrar a Software Libre.<br />
		 Naudy Villarroel.<br /></h3>
				La idea esencial de esta ponencia es borrar ese gran miedo de pel&iacute;cula 
				de Terror que giran en torno al software libre: como que es dif&iacute;cil de 
				usar, que si es malo gratis, que es solo para usuarios avanzados, que con ese 
				software no hay soporte, que es m&aacute;s inseguro ,etc. Usualmente son emitidos 
				como antipropaganda por parte de las empresas y de gente que en realidad no 
				conoce del tema del que habla.<br />
				Es muy f&aacute;cil probar la falsedad. "GNU/Linux es dif&iacute;cil de usar" 
				el esfuerzo que se ha dedicado a este tema ha llevado a tener interfaces gr&aacute;ficas 
				tanto o m&aacute;s intuitivas que las disponibles en sistemas comerciales. 
				Los procedimientos de instalaci&oacute;n tambi&eacute;n se han vuelto simples 
				gracias a las "distribuciones". <br />
				0El modelo abierto de desarrollo permite que miles de personas efect&uacute;en 
				el control de calidad y correcci&oacute;n de errores a la vez.<br />
           <a href="ponencias/Naudi.pdf">&nbsp;Descargar Presentaci&oacute;n...</a>
		<br /><br /><br />
	
        <hr />

		<img src="images/Ponentes/Arduino.png" alt="img" id="ponencia" />
		<h3>
		 Libertad de Hardware con Arduino y Processing.<br />
		 Victor Cumana.<br /></h3>
		 La presente ponencia data de la filosofia del hardware libre, el cual pretende explicar de 
		 forma breve y sencilla a los participantes del 7cnsl su historia (inicio, sus creadores, 
		 lugar de origen, entre otros), al igual que dar a conocer las licencias libres que la 
		 defiende. Se hablara de, por que usar Arduino?, y a medida que avanza la presentacion se 
		 diran sus ventajas y desventajas.<br />
		<a href="ponencias/ponenciaArduino.pdf">&nbsp;Descargar Presentaci&oacute;n...</a>
		<br /><br /><br />
              
	<hr />

		<img src="images/Ponentes/SinInformacion.jpg" alt="img" id="ponencia" />
		<h3>
		 Desarrollo de Aplicaciones Open Source en la Nube.<br />
		 Gerardo Sandoval. <br /></h3>
		 La ponencia se enfoca en la utilizaci&oacute;n de Cloud Computing(Internet en la Nube) 
		 y el porque se debe emplear este tipo de tecnologia  explicando beneficios como el ahorro 
		 en la implementaci&oacute;n del Hardware, Conectividad, la alta disponibilidad de servicios 
		 a precios justos y otros factores importantes; permitiendo asi un servicio accesible a todos.<br /> 
		 Y el proceso de como implementar un Sistema en La Nube. <br />
		<a href="sinmaterial.html">&nbsp;Descargar Presentaci&oacute;n...</a>
		<br /><br /><br />
		
	<hr />

		<img src="images/Ponentes/SinInformacion.jpg" alt="img" id="ponencia" />
		<h3>
		 Telefonía VoIP: Elastix.<br />
		 Andy Martinez. <br /></h3>
		 Se explicara el conjunto de normas, dispositivos, protocolos, que conforman la tecnolog&iacute;a que 
		 permite comunicar voz sobre el protocolo IP. La ventajas de este tipo de tecnolog&iacute;a como los son: 
		 bajo costo, portabilidad e integraci&oacute;n y desventajas como: la calidad de voz y dependencia de la red. 
		 La implementaci&oacute;n y funcionalidad de Elastix para este tipo de tecnolog&iacute;a; el cual es una herramienta 
		 empresarial de c&oacute;digo abierto distribuida bajo la licencia GPLv2. <br />
		<a href="sinmaterial.html">&nbsp;Descargar Presentaci&oacute;n...</a>
		<br /><br /><br />
		
	<hr />
	
		<img src="images/Ponentes/willicab.png" alt="img" id="ponencia" />
		<h3>
		 Cloud Computing y Redes Sociales. Sobre la Web 2.0.<br />
		 William Cabrera. <br /></h3>
		 En esta presentaci&oacute;n se mostrar&aacute; un breve repaso por la historia de la web, una explicaci&oacute;n 
		 del momento en que nos encontramos, y una proyecci&oacute;n de lo que ser&aacute; el futuro<br /><br /><br />
		<a href="ponencias/cloud computing.pdf">&nbsp;Descargar Presentaci&oacute;n...</a>
		<br /><br /><br />
		
	<hr />

		<img src="images/Ponentes/Danilo.png" alt="img" id="ponencia" />
		<h3>
		Software Libre en Entornos Industriales: Estudios de Casos.<br />
		Danilo Navarro.<br /></h3>
		Los computadores industriales son sistemas electr&oacute;nicos de control constituidos por un computador de prop&oacute;sito 
		general adecuadamente dise&ntilde;ado y montado para poder trabajar en el entorno de un proceso industrial.<br />
		El sistema operativo – S.O, proporciona la interfase entre el usuario y los recursos de Hardware del computador.<br />
		<a href="ponencias/presentación.pdf">&nbsp;Descargar Presentaci&oacute;n...</a>
		<br /><br /><br />
		
	<hr />
		<img src="images/Ponentes/disSL.png" alt="img" id="ponencia" />
		<h3>
		Discapacidad y Software Libre.<br />
		Nerissa Aguilera. <br /></h3>
		Mundo Accesible es una iniciativa de car&aacute;cter voluntario, altruista y solidario que surgi&oacute; de la libre 
		iniciativa de algunos&frasl;as integrantes de la comunidad del SL.<br />
		Pretende abrir un espacio para la reflexi&oacute;n y plantear alternativas para nuevos desarrollos a fin de que los 
		esfuerzos para incorporar accesibilidad a las tecnolog&iacute;as se encuentren orientados o relacionados de manera directa 
		con las discapacidades f&iacute;sicas. En esta charla se realiza un recuento de las herramientas y proyectos existentes en 
		Software Libre destinados a dignificar la vida de las personas con discapacidad. <br /><br />
		<a href="ponencias/discapacidad y soft libre.pdf">&nbsp;Descargar Presentaci&oacute;n...</a>
		<br /><br /><br />
		
	<hr />
	
		
	<div id="footer">
	<div class="right">Diseño: <a href="http://www.free-css-templates.com">David Herreman</a></div>
	&copy; Copyleft 2011, Proyecto GNU de Venezuela
	</div>
</div>

</body>
</html>
